#!/c/Users/AngryBear/AppData/Local/Microsoft/WindowsApps/python
#Заданы 2 списка: a = [1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89] b = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13] Напишите скрипт, который вернет 1 список, в котором будут элементы общие для списков a и b. Результирующий список не должен содержать дубликатов.
a = [1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89]
b = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13]
c = []
for i in a:
    if i in c:
        continue
    for j in b:
        if i == j:
            c.append(i)
            break
print(c)
